[
    {
        "opening_remarks": "In the chaotic final years of the Eastern Han Dynasty, amidst corruption and rebellion, three heroes are destined to meet and forge a legendary bond.",
        "npc": [
            {
                "name": "Zhang Fei",
                "dialogue": [
                    [
                        "Zhang Fei",
                        "A real man does not serve the country, what are you sighing for!"
                    ],
                    [
                        "Liu Bei",
                        "I am a kinsman of the Han Imperial House, surnamed Liu, named Bei. Now the Yellow Turbans are causing chaos, I have the heart to kill thieves for the country, but hate that my strength is insufficient, hence I sigh."
                    ],
                    [
                        "Zhang Fei",
                        "I have quite a bit of property at home. We can recruit local brave men and plan great deeds together, how about that?"
                    ],
                    [
                        "Zhang Fei",
                        "Behind my manor there is a peach garden, the flowers are blooming just right. Tomorrow, we should sacrifice to heaven and earth in the garden, become brothers, work together with one heart, and achieve great things together."
                    ],
                    [
                        "Liu Bei",
                        "Good."
                    ]
                ],
                "sprite": "npc_ZhangFei.png",
                "avatar": "npc_ZhangFei_avatar.png"
            },
            {
                "name": "Guan Yu",
                "dialogue": [
                    [
                        "Liu Bei",
                        "May I ask your name?"
                    ],
                    [
                        "Guan Yu",
                        "I am surnamed Guan, named Yu, style name Yunchang. Because I killed a bully back then, I have been wandering outside for five or six years. Hearing that there is military recruitment here, I specially came to join."
                    ]
                ],
                "sprite": "npc_GuanYu.png",
                "avatar": "npc_GuanYu_avatar.png"
            }
        ],
        "location": "The streets of Zhuo County are bustling yet marked by the dust and anxiety of the times. Traditional Han architecture with grey tiled roofs lines the road. ",
        "background_image": "background_scene_0.png",
        "building_coordinates": [
            {
                "x": 0,
                "y": 0,
                "w": 320,
                "h": 360
            },
            {
                "x": 960,
                "y": 0,
                "w": 300,
                "h": 380
            },
            {
                "x": 1260,
                "y": 0,
                "w": 840,
                "h": 360
            },
            {
                "x": 2150,
                "y": 0,
                "w": 410,
                "h": 360
            },
            {
                "x": 0,
                "y": 1100,
                "w": 250,
                "h": 340
            },
            {
                "x": 330,
                "y": 1040,
                "w": 500,
                "h": 400
            },
            {
                "x": 1550,
                "y": 960,
                "w": 350,
                "h": 480
            },
            {
                "x": 1900,
                "y": 1000,
                "w": 660,
                "h": 440
            }
        ],
        "player": {
            "name": "Liu Bei",
            "outfit": "Simple woven sandals and a modest Han dynasty commoner's robe, appearing dignified despite his poverty."
        }
    },
    {
        "npc": [
            {
                "name": "Zhang Fei",
                "dialogue": [
                    [
                        "Liu Bei",
                        "What is happening here?"
                    ],
                    [
                        "Zhang Fei",
                        "Such a pest who harms the people! If I don't beat him to death, what's the use of keeping him!"
                    ]
                ],
                "sprite": "npc_ZhangFei.png",
                "avatar": "npc_ZhangFei_avatar.png"
            },
            {
                "name": "Du You",
                "dialogue": [
                    [
                        "Du You",
                        "Lord Xuande, save my life!"
                    ]
                ],
                "sprite": "npc_DuYou.png",
                "avatar": "npc_DuYou_avatar.png"
            },
            {
                "name": "Guan Yu",
                "dialogue": [
                    [
                        "Guan Yu",
                        "Brother has established many great merits, yet only serves as a county defender, and now is insulted by this inspector instead. I see this is not a place to stay for long. Better to kill the inspector, abandon this petty official post, and plan a grand strategy elsewhere."
                    ],
                    [
                        "Liu Bei",
                        "You harm the people like this, I ought to take your life. Today I temporarily spare you, we are leaving!"
                    ]
                ],
                "sprite": "npc_GuanYu.png",
                "avatar": "npc_GuanYu_avatar.png"
            }
        ],
        "location": "The County Station in Anxi, a place representing imperial bureaucracy. It features a courtyard with a horse-hitching post where the violent confrontation occurs. The atmosphere is tense and angry, contrasting the rigid, corrupt officialdom with the raw justice of the protagonists.",
        "background_image": "background_scene_1.png",
        "building_coordinates": [
            {
                "x": 0,
                "y": 0,
                "w": 640,
                "h": 580
            },
            {
                "x": 0,
                "y": 580,
                "w": 220,
                "h": 420
            },
            {
                "x": 1050,
                "y": 0,
                "w": 500,
                "h": 450
            },
            {
                "x": 1550,
                "y": 0,
                "w": 600,
                "h": 500
            },
            {
                "x": 2150,
                "y": 0,
                "w": 410,
                "h": 880
            },
            {
                "x": 0,
                "y": 1180,
                "w": 650,
                "h": 260
            },
            {
                "x": 1150,
                "y": 1180,
                "w": 1410,
                "h": 260
            },
            {
                "x": 2300,
                "y": 950,
                "w": 260,
                "h": 230
            }
        ]
    }
]